{
  "child_mtb_helmet": {
    "name": "Small Colorful Helmet",
    "description": "A tiny mountain bike helmet with bright colors and fun stickers. It's much smaller than any adult helmet you've seen - definitely designed for a very small human head. The padding inside looks soft and protective.",
    "pickup_message": "You carefully retrieve the small helmet. It's surprisingly light and smells new. Something about its tiny size makes you feel protective and excited at the same time.",
    "use_message": "You gently set down the small helmet. Its bright colors gleam in the light, and you can't help but wag your tail looking at it.",
    "can_pickup": true,
    "consumable": false,
    "value": 100,
    "special_effect": "quest_item"
  },
  "child_mtb_gloves": {
    "name": "Tiny Mountain Bike Gloves",
    "description": "A pair of small mountain biking gloves with protective padding on the palms. They're incredibly tiny - definitely made for very small hands. The bright colors and fun patterns suggest they're designed for someone who loves adventure.",
    "pickup_message": "You delicately pick up the tiny gloves with your teeth. They're so small they barely fill your mouth, and they smell like new fabric and exciting possibilities.",
    "use_message": "You place the tiny gloves carefully on the ground. Looking at them, you realize they're meant for hands much smaller than any you know.",
    "can_pickup": true,
    "consumable": false,
    "value": 100,
    "special_effect": "quest_item"
  },
  "small_mtb_bike": {
    "name": "Miniature Mountain Bike",
    "description": "A beautiful, tiny mountain bike with training wheels and bright, cheerful colors. It's perfectly proportioned but incredibly small - clearly designed for someone much, much smaller than any human you know. The sight of it makes everything click into place.",
    "pickup_message": "This bike is too big to carry in your mouth, but you can push it with your nose. As you examine it closely, your heart starts racing with excitement. This bike is for someone VERY small...",
    "use_message": "You sit next to the tiny bike, and suddenly everything makes perfect sense. This isn't just any bike - it's for a CHILD! All the items you've been finding... they're all child-sized! Your tail won't stop wagging!",
    "can_pickup": false,
    "consumable": false,
    "value": 200,
    "special_effect": "quest_item"
  },
  "favorite_bone": {
    "name": "Your Favorite Bone",
    "description": "Your beloved chew bone that you've had for months. It's perfectly shaped from your teeth marks and carries the comforting scent of many happy chewing sessions. Sometimes familiar items can be useful in unexpected ways.",
    "pickup_message": "You pick up your trusty bone. Its familiar weight and texture in your mouth is reassuring and comforting.",
    "use_message": "You set down your favorite bone. It might not seem special to others, but it's precious to you.",
    "can_pickup": true,
    "consumable": false,
    "value": 10,
    "special_effect": "comfort_item"
  },
  "garden_key": {
    "name": "Small Garden Key",
    "description": "A small brass key that smells like metal and earth. It looks like it might open something in the garden area - perhaps the tool shed where something important is waiting.",
    "pickup_message": "You carefully pick up the small key with your teeth. The metal feels cool and important.",
    "use_message": "You drop the key with a small metallic clink. It's clearly meant to unlock something special.",
    "can_pickup": true,
    "consumable": true,
    "value": 25,
    "special_effect": "unlock_tool"
  },
  "step_stool": {
    "name": "Small Step Stool",
    "description": "A wooden step stool that the humans sometimes use to reach high places. Perfect for a determined dog who needs to get to higher shelves or cabinets that might contain important discoveries.",
    "pickup_message": "You grab the step stool by its edge and start dragging it across the floor. It's heavier than expected but manageable for a strong dog like you.",
    "use_message": "You position the step stool carefully. Now you should be able to reach places that were too high before!",
    "can_pickup": true,
    "consumable": false,
    "value": 15,
    "special_effect": "reach_tool"
  },
  "old_sock": {
    "name": "Soft Old Sock",
    "description": "A well-worn sock that somehow ended up under the bed. It's soft and might be useful for carrying small items or just providing comfort during your adventure.",
    "pickup_message": "You pick up the old sock. It has that familiar laundry scent and feels soft and comforting in your mouth.",
    "use_message": "You set down the old sock. Its soft fabric might be useful for something, or maybe it's just nice to have.",
    "can_pickup": true,
    "consumable": false,
    "value": 5,
    "special_effect": "soft_tool"
  }
}