{
  "living_room": {
    "name": "Living Room",
    "description": "You're in the cozy living room where you and Maxwell usually relax. Sunlight streams through the windows, and your favorite dog bed sits in the corner. Maxwell is sitting by the window, staring intently at something you can't see. His tail is twitching in that mysterious way that means he knows something important.",
    "first_visit_description": "You wake up from your afternoon nap and notice Maxwell behaving strangely. The gray and white cat is sitting perfectly still by the large window, his green eyes focused on... nothing visible. His ears are perked forward, and his tail does that slow, deliberate twitch that means he's thinking about something important. The living room feels different today - charged with anticipation.",
    "exits": {
      "north": "kitchen",
      "east": "bedroom", 
      "south": "balcony"
    },
    "actions": {
      "examine maxwell": "examine_maxwell_start",
      "look at maxwell": "examine_maxwell_start",
      "examine window": "examine_living_window",
      "examine dog bed": "examine_dog_bed",
      "sniff around": "sniff_living_room"
    },
    "items": [],
    "visited": false
  },
  "kitchen": {
    "name": "Kitchen",
    "description": "The kitchen smells of familiar scents - kibble, treats, and the lingering aroma of human food. High cabinets line the walls, some with handles you could potentially reach if you're clever. Maxwell sits on the counter, which he's not supposed to do, staring at one particular cabinet with unusual intensity.",
    "first_visit_description": "You pad into the kitchen, your claws clicking softly on the tile floor. The room smells like home - your food bowl, treats, and the comforting scents of family meals. But Maxwell is here, sitting boldly on the forbidden counter, his yellow-green eyes fixed on a high cabinet with unwavering focus. He glances at you briefly, then back at the cabinet, as if trying to tell you something important.",
    "exits": {
      "south": "living_room",
      "east": "storage_room"
    },
    "actions": {
      "examine maxwell": "examine_maxwell_kitchen",
      "examine cabinet": "examine_high_cabinet", 
      "examine cabinets": "examine_kitchen_cabinets",
      "open cabinet": "get_step_stool_action",
      "open lower cabinet": "get_step_stool_action",
      "jump on counter": "jump_kitchen_counter",
      "examine treats": "examine_treat_jar",
      "sniff cabinet": "sniff_high_cabinet"
    },
    "items": [],
    "visited": false
  },
  "bedroom": {
    "name": "Bedroom",
    "description": "The humans' bedroom is quiet and peaceful. The big bed dominates the room, and there's a closet with sliding doors that sometimes hide interesting things. Sunlight filters through curtains, creating warm patches on the floor where Maxwell likes to nap - but today he's not napping. He's investigating something under the bed.",
    "first_visit_description": "You enter the bedroom where your humans sleep. It's quiet and serene, with the large bed you sometimes sneak onto when no one's looking. The closet doors are slightly ajar, and morning light creates golden rectangles on the carpet. Maxwell emerges from under the bed, a dusty whisker indicating he's been exploring spaces too small for you. He looks at you meaningfully, then back under the bed.",
    "exits": {
      "west": "living_room"
    },
    "actions": {
      "examine maxwell": "examine_maxwell_bedroom",
      "look under bed": "examine_under_bed",
      "examine closet": "examine_bedroom_closet",
      "examine bed": "examine_big_bed",
      "sniff around": "sniff_bedroom"
    },
    "items": [],
    "visited": false
  },
  "balcony": {
    "name": "Balcony",
    "description": "The small balcony overlooks the garden below. Plant pots line the railing, and there's a small storage box where garden tools are kept. The fresh air carries scents from the garden - earth, plants, and something else that makes your nose twitch with curiosity. Maxwell sits by the railing, looking down at the garden with intense focus.",
    "first_visit_description": "You step onto the balcony and immediately your senses come alive with outdoor scents. The small space is filled with plant pots and garden tools, and the view over the garden below is spectacular for a dog's nose - so many interesting smells! Maxwell is perched by the railing like a furry sentinel, his gaze fixed on something specific in the garden below. The wind ruffles his fur as he remains perfectly still, concentrating.",
    "exits": {
      "north": "living_room",
      "down": "garden"
    },
    "actions": {
      "examine maxwell": "examine_maxwell_balcony",
      "look at garden": "examine_garden_from_balcony",
      "examine storage box": "examine_balcony_box",
      "examine plants": "examine_balcony_plants",
      "sniff air": "sniff_balcony_air"
    },
    "items": [],
    "visited": false
  },
  "garden": {
    "name": "Garden",
    "description": "The garden is your outdoor paradise - grass to run on, bushes to explore, and dozens of fascinating scents. There are flower beds, a small tool shed, and various hiding spots you've discovered over the years. Maxwell appears from behind a large plant, dirt on his paws, looking at you with that 'I found something important' expression.",
    "first_visit_description": "You bound into the garden, your favorite outdoor space! The grass feels soft under your paws, and every direction offers new scents and adventures. Flower beds line the edges, the small tool shed sits in the corner, and there are countless spots perfect for burying treasures or finding them. Maxwell emerges from behind a large rhododendron, his usually pristine paws now dusty with soil, giving you a look that clearly says 'pay attention - this is important.'",
    "exits": {
      "up": "balcony"
    },
    "actions": {
      "examine maxwell": "examine_maxwell_garden",
      "examine tool shed": "examine_garden_shed",
      "open shed": "unlock_garden_shed",
      "unlock shed": "unlock_garden_shed",
      "examine flower beds": "examine_flower_beds",
      "dig behind plants": "dig_behind_plants",
      "sniff around": "sniff_garden",
      "examine rhododendron": "examine_big_plant"
    },
    "items": [],
    "visited": false
  },
  "storage_room": {
    "name": "Storage Room",
    "description": "The storage room is filled with boxes, old furniture, and items the humans don't use every day. It's dimmer here, with only a small window providing light. The air smells of dust and forgotten things. This feels like a place where important items might be hidden away, waiting to be discovered.",
    "first_visit_description": "You push through the door into the storage room, a space that always feels mysterious and full of possibilities. Boxes are stacked along the walls, old furniture is covered with sheets, and the air has that dusty, patient smell of things waiting to be rediscovered. Light from a small window creates interesting shadows and highlights. This room feels like it's keeping secrets.",
    "exits": {
      "west": "kitchen"
    },
    "actions": {
      "examine boxes": "examine_storage_boxes",
      "examine furniture": "examine_covered_furniture", 
      "sniff around": "sniff_storage_room",
      "look behind boxes": "look_behind_storage_boxes",
      "examine window": "examine_storage_window"
    },
    "items": [],
    "visited": false
  }
}