{
  "living_room": {
    "name": "Living Room",
    "description": "You're in the cozy living room where sunlight streams through the windows. Maxwell sits by the window, staring intently at something only he can see. His tail twitches with purpose - he definitely wants you to follow him somewhere.",
    "first_visit_description": "You wake up from your afternoon nap to find Maxwell behaving very strangely. The black and brown cat with white paws and chest is sitting perfectly still by the large window, his yellow eyes focused on... nothing you can see. But his ears are perked forward and his tail does that slow, meaningful twitch that says 'I know something important.' The living room feels charged with anticipation.",
    "exits": {
      "kitchen": "kitchen",
      "bedroom": "bedroom"
    },
    "actions": {
      "follow maxwell's gaze": "maxwell_leads_to_kitchen",
      "examine window": "examine_living_window",
      "examine dog bed": "examine_dog_bed"
    },
    "items": [],
    "visited": false
  },
  "kitchen": {
    "name": "Kitchen",
    "description": "The kitchen smells of kibble and treats. Maxwell sits boldly on the forbidden counter (which he never does!), staring up at a high cabinet with laser focus. He looks at you, then at the cabinet, then back at you. His message is clear: 'Something important is up there.'",
    "first_visit_description": "You follow Maxwell into the kitchen, your claws clicking on the tile floor. The room carries the familiar scents of home, but Maxwell is acting completely out of character - sitting on the counter he's never allowed on! His yellow eyes are fixed on one particular high cabinet with unwavering intensity.",
    "exits": {
      "living room": "living_room",
      "balcony": "balcony"
    },
    "actions": {
      "get step stool": "get_step_stool_action",
      "jump on counter": "jump_kitchen_counter",
      "examine cabinet": "examine_high_cabinet"
    },
    "items": [],
    "visited": false
  },
  "bedroom": {
    "name": "Bedroom",
    "description": "The humans' quiet bedroom has a big bed and a closet. Maxwell emerges from under the bed with dusty whiskers, then sits next to it and pats the floor with his paw. He's found something under there that needs your help to retrieve.",
    "first_visit_description": "You enter the peaceful bedroom where your humans sleep. Maxwell appears from under the bed, a dusty whisker showing he's been exploring tight spaces. He looks at you meaningfully, then pats the floor next to the bed with his paw.",
    "exits": {
      "living room": "living_room"
    },
    "actions": {
      "look under bed": "examine_under_bed"
    },
    "items": [],
    "visited": false
  },
  "balcony": {
    "name": "Balcony",
    "description": "The small balcony overlooks the garden below. Plant pots and a storage box sit along the railing. Maxwell perches by the edge like a furry sentinel, staring down at something specific in the garden with complete focus.",
    "first_visit_description": "You step onto the balcony and breathe in the fresh outdoor air. The view of the garden below is spectacular, full of interesting scents. Maxwell sits by the railing like a statue, his gaze locked on one particular spot in the garden below.",
    "exits": {
      "kitchen": "kitchen",
      "garden": "garden"
    },
    "actions": {
      "examine storage box": "examine_balcony_box",
      "look at garden": "examine_garden_from_balcony"
    },
    "items": [],
    "visited": false
  },
  "garden": {
    "name": "Garden",
    "description": "Your favorite outdoor space! The garden has flower beds, a tool shed, and plenty of interesting scents. Maxwell appears from behind a large rhododendron bush, his usually pristine paws now dirty with soil. He sits precisely at a spot where the earth looks recently disturbed.",
    "first_visit_description": "You enter the garden, your outdoor paradise! The grass feels soft under your paws and every direction offers new adventures. Maxwell emerges from behind a large rhododendron, his paws uncharacteristically dirty, giving you a look that clearly says 'dig here!'",
    "exits": {
      "balcony": "balcony",
      "tool shed": "tool_shed"
    },
    "actions": {
      "dig here": "dig_behind_plants",
      "follow maxwell's gaze": "dig_behind_plants",
      "examine shed": "examine_garden_shed"
    },
    "items": [],
    "visited": false
  },
  "tool_shed": {
    "name": "Tool Shed",
    "description": "The small garden shed contains tools, plant pots, and storage. There's something special here that Maxwell has been leading you toward - something that will complete your understanding of his mysterious quest.",
    "first_visit_description": "You approach the small tool shed in the corner of the garden. The wooden structure stores garden tools and supplies, but Maxwell's behavior suggests there's something much more important here than just gardening equipment.",
    "exits": {
      "garden": "garden"
    },
    "actions": {
      "unlock shed": "unlock_garden_shed",
      "examine inside": "examine_shed_contents"
    },
    "items": [],
    "visited": false
  }
}